[Killed] BlockStatement
main/pages/Reviews/ReviewsLookupPage.js:3:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ReviewsLookupPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>This page will eventually show reviews for an item</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewsLookupPage() {}
 
killedBy: ReviewsLookupPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: This page will eventually show reviews for an item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
