[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.js:7:5
 
 export default function DiningCommonsTable({ diningcommons }) {
   const columns = [
-    {
-      Header: "Name",
-      accessor: "name",
-      Cell: ({ value, row }) => (
-        <Link to={`/diningcommons/${row.original.code}`}>{value}</Link>
-      ),
-    },
+    {},
     {
       Header: "Code",
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:10:13
     {
       Header: "Name",
       accessor: "name",
-      Cell: ({ value, row }) => (
-        <Link to={`/diningcommons/${row.original.code}`}>{value}</Link>
-      ),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name "Portola"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:16:17
     },
     {
       Header: "Code",
-      accessor: "code",
+      accessor: "",
     },
     {
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.js:18:5
       Header: "Code",
       accessor: "code",
     },
-    {
-      Header: "Has DiningCam",
-      accessor: "hasDiningCam",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
-    },
+    {},
     {
       Header: "Has Sack Meal",
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:20:17
     },
     {
       Header: "Has DiningCam",
-      accessor: "hasDiningCam",
+      accessor: "",
       Cell: ({ value }) => (value ? "Yes" : "No"),
     },
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-hasDiningCam"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:31:13
     {
       Header: "Has Takeout Meal",
       accessor: "hasTakeoutMeal",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
   ];
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:31:37
     {
       Header: "Has Takeout Meal",
       accessor: "hasTakeoutMeal",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: ({ value }) => (value ? "" : "No"),
     },
   ];
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] EqualityOperator
main/components/DiningCommons/DiningCommonsTable.js:37:8
 
   return (
     <div>
-      {diningcommons.length === 0 ? (
+      {diningcommons.length !== 0 ? (
         <div data-testid="DiningCommonsTable-empty-message">
           No data available
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-empty-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.js:37:8
 
   return (
     <div>
-      {diningcommons.length === 0 ? (
+      {false ? (
         <div data-testid="DiningCommonsTable-empty-message">
           No data available
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-empty-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.js:45:19
         <OurTable
           data={diningcommons}
           columns={columns}
-          testid={"DiningCommonsTable"}
+          testid={""}
         />
       )}
killedBy: DiningCommonsTable tests renders table with dining commons correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <table
        class="table table-striped table-bordered table-hover"
