[Killed] StringLiteral
main/components/Review/ReviewTable.js:21:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/myreviews/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: ReviewTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/myreviews/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Review/ReviewTable.js:38:37
     deleteMutation.mutate(cell);
   };
 
-  const approveCallback = (cell) => {
-    console.log(`Approved review with id: ${cell.row.values.id}`);
-  };
+  const approveCallback = (cell) => {};
 
   const rejectCallback = (cell) => {
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Approved review with id: 1"

Number of calls: 0

[Killed] StringLiteral
main/components/Review/ReviewTable.js:39:17
   };
 
   const approveCallback = (cell) => {
-    console.log(`Approved review with id: ${cell.row.values.id}`);
+    console.log(``);
   };
 
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Approved review with id: 1"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/components/Review/ReviewTable.js:42:36
     console.log(`Approved review with id: ${cell.row.values.id}`);
   };
 
-  const rejectCallback = (cell) => {
-    console.log(`Rejected review with id: ${cell.row.values.id}`);
-  };
+  const rejectCallback = (cell) => {};
 
   const columns = [
killedBy: ReviewTable tests Reject button triggers callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Rejected review with id: 1"

Number of calls: 0

[Killed] StringLiteral
main/components/Review/ReviewTable.js:43:17
   };
 
   const rejectCallback = (cell) => {
-    console.log(`Rejected review with id: ${cell.row.values.id}`);
+    console.log(``);
   };
 
killedBy: ReviewTable tests Reject button triggers callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Rejected review with id: 1"
Received: ""

Number of calls: 1

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:51:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Reviewer ID",
-      accessor: "reviewerId",
-    },
+    {},
     {
       Header: "Item ID",
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:67:5
       Header: "Stars",
       accessor: "stars",
     },
-    {
-      Header: "Review Text",
-      accessor: "reviewText",
-    },
+    {},
     {
       Header: "Status",
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:68:15
       accessor: "stars",
     },
     {
-      Header: "Review Text",
+      Header: "",
       accessor: "reviewText",
     },
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Review Text. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:75:5
       Header: "Status",
       accessor: "status",
     },
-    {
-      Header: "Mod ID",
-      accessor: "modId",
-    },
+    {},
     {
       Header: "Moderator Comments",
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:79:5
       Header: "Mod ID",
       accessor: "modId",
     },
-    {
-      Header: "Moderator Comments",
-      accessor: "modComments",
-    },
+    {},
     {
       Header: "Created Date",
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:83:5
       Header: "Moderator Comments",
       accessor: "modComments",
     },
-    {
-      Header: "Created Date",
-      accessor: "createdDate",
-    },
+    {},
     {
       Header: "Last Edited Date",
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:87:5
       Header: "Created Date",
       accessor: "createdDate",
     },
-    {
-      Header: "Last Edited Date",
-      accessor: "lastEditedDate",
-    },
+    {},
   ];
 
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:88:15
       accessor: "createdDate",
     },
     {
-      Header: "Last Edited Date",
+      Header: "",
       accessor: "lastEditedDate",
     },
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Edited Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Review/ReviewTable.js:95:20
 
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "success", approveCallback, "ReviewTable"),
+      ButtonColumn("", "success", approveCallback, "ReviewTable"),
       ButtonColumn("Reject", "danger", rejectCallback, "ReviewTable"),
     );
killedBy: ReviewTable tests Approve button triggers callback
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:95:31
 
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "success", approveCallback, "ReviewTable"),
+      ButtonColumn("Approve", "", approveCallback, "ReviewTable"),
       ButtonColumn("Reject", "danger", rejectCallback, "ReviewTable"),
     );
killedBy: ReviewTable tests Shows Approve and Reject buttons when moderatorOptions is true
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/components/Review/ReviewTable.js:96:56
   if (moderatorOptions) {
     columns.push(
       ButtonColumn("Approve", "success", approveCallback, "ReviewTable"),
-      ButtonColumn("Reject", "danger", rejectCallback, "ReviewTable"),
+      ButtonColumn("Reject", "danger", rejectCallback, ""),
     );
   }
killedBy: ReviewTable tests Reject button triggers callback
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Reject-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Review/ReviewTable.js:99:43
       ButtonColumn("Reject", "danger", rejectCallback, "ReviewTable"),
     );
   }
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "ReviewTable"));
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
   if (deleteColumn && hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
killedBy: ReviewTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Review/ReviewTable.js:102:59
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "ReviewTable"));
   }
-  if (deleteColumn && hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ReviewTable"),
-    );
-  }
+  if (deleteColumn && hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={reviews} columns={columns} testid={"ReviewTable"} />;
killedBy: ReviewTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/Review/ReviewTable.js:102:7
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "ReviewTable"));
   }
-  if (deleteColumn && hasRole(currentUser, "ROLE_ADMIN")) {
+  if (deleteColumn || hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "ReviewTable"),
killedBy: ReviewTable tests Does not show Delete button when deleteColumn is false
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="ReviewTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] StringLiteral
main/components/Review/ReviewTable.js:108:61
     );
   }
 
-  return <OurTable data={reviews} columns={columns} testid={"ReviewTable"} />;
+  return <OurTable data={reviews} columns={columns} testid={""} />;
 }
 
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
