[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:12:30
 export default function MyReviewsIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/reviews/create"
-          style={{ float: "right" }}
-        >
-          Create Reviews
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: MyReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Review/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/reviews/create"
-          style={{ float: "right" }}
-        >
-          Create Reviews
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: MyReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Review/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:18:18
         <Button
           variant="primary"
           href="/reviews/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Reviews
killedBy: MyReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:45:25
         <ReviewTable
           reviews={reviews}
           currentUser={currentUser}
-          deleteColumn={true}
+          deleteColumn={false}
         />
       </div>
killedBy: MyReviewsIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
