[Killed] BlockStatement
main/pages/DiningCommons/DiningCommonsPage.js:4:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router-dom";
 
-export default function ReviewsLookupPage() {
-  let { diningCommonsCode } = useParams();
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Placeholder for Dining Commons Page for {diningCommonsCode}</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewsLookupPage() {}
 
killedBy: ReviewsLookupPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Placeholder for Dining Commons Page for. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
